{
  "basics": {
    "label": "Software Development Manager",
    "website": "alpha59.github.io",
    "phone": "1-484-354-9199",
    "email": "ailor.john.r@gmail.com",
    "location": {
      "city": "Seattle",
      "region": "Washington"
    },
    "name": "John R. Ailor",
    "fname": "John",
    "mname": "R.",
    "lname": "Ailor",
    "cover": "Please find enclosed my resume, which outlines my relevant experience for this position, as well as my education. I am an experienced Software Engineer with a demonstrated history of working in e-commerce, operations, and cloud computing. I am skilled in Software Architecture, Technical Writing, Software Development, and hold a Bachelor\\textquotesingle s degree focused in Computer Engineering from Drexel University. I have gained over nine years of experience working with a full stack of web technologies and general back-end computing platforms. Over the course of my career I have had the opportunity to gain a great deal of experience writing technical reports and documenting software architecture. I have lead several teams through various projects, seen multiple projects go from idea to production under my supervision, and mentored numerous junior team members in their project goals. I consider myself a well rounded programmer with a focus on real world software applications that contribute to advancing productivity and business goals of the company or client for which I am working. I believe that any team I am given the opportunity to work with will find that I am a dedicated employee who looks for the best solution to any problem.",
    "summary": "Enterprising Software Engineer with 9+ years of experience working to deliver sustainable applications focused around highly configurable, scalable, and capable designs. Managed the re-architecture of numerous business critical applications, both customer facing and operational. Eager to work closely with a new team in a management role to find the ideal solutions to software problems.",
    "picture": "",
    "profiles": [
      {
        "network": "GitHub",
        "username": "alpha59",
        "url": "https://github.com/alpha59"
      },
      {
        "network": "LinkedIn",
        "username": "John R. Ailor",
        "url": "https://www.linkedin.com/in/john-r-ailor/"
      }
    ]
  },
  "skills": [
    {
      "name": "Front-end Development",
      "level": "Master",
      "keywords": [
        "JavaScript",
        "React",
        "TypeScript",
        "jQuery"
      ]
    },
    {
      "name": "Microservice Development",
      "level": "Master",
      "keywords": [
        "Node.js",
        "Python",
        "Java",
        "Microservice",
        "Nanoservice"
      ]
    },
    {
      "name": "Software Architecture",
      "level": "Master",
      "keywords": [
        "AWS",
        "Cloud",
        "Database",
        "Microservice",
        "Nanoservice",
        "RDS",
        "MongoDB",
        "DocumentDB",
        "NoSql"
      ]
    },
    {
      "name": "Languages",
      "level": "Master",
      "keywords": [
        "C++",
        "Python",
        "php",
        "Java",
        "JavaScript",
        "Node.js",
        "Ruby",
        "C#",
        "ASP.NET MVC",
        "VB",
        "C",
        "Awk",
        "Lisp",
        "Octave",
        "VHDL",
        "SQL",
        "perl",
        "Swift"
      ]
    },
    {
      "name": "Software/Applications",
      "level": "Master",
      "keywords": [
        "MS Visual Studio",
        "Git",
        "Netbeans",
        "AutoCAD",
        "Sketchup",
        "LabView",
        "MS Office Suite with VB Macros",
        "MATLAB",
        "Hadoop",
        "Spark",
        "Linux (Bash)",
        "Vim",
        "Eclipse",
        "Unity",
        "Unreal"
      ]
    },
    {
      "name": "Databases",
      "level": "Master",
      "keywords": [
        "MongoDB",
        "DocumentDB",
        "DynamoDB",
        "RDS",
        "MySQL",
        "Neo4j",
        "PostgreSQL",
        "Microsoft SQL Server",
        "Elasticsearch"
      ]
    },
    {
      "name": "Markup/Style",
      "level": "Master",
      "keywords": [
        "Multi-Markdown",
        "HTML5",
        "LaTeX",
        "CSS3",
        "Bootstrap",
        "Sass",
        "LESS"
      ]
    },
    {
      "name": "Integration Testing",
      "level": "Master",
      "keywords": [
        "Selenium",
        "nightwatch.js",
        "webdriver.io"
      ]
    }
  ],
  "meta": {
    "version": "vAMZN-1",
    "lastModified": "2021-06-05",
    "name": "resume",
    "role": "software-development-manager",
    "focus": "management",
    "company": "",
    "notes": "",
    "theme": "elegant"
  },
  "education": [
    {
      "institution": "Drexel University",
      "area": "Computer Engineering",
      "location": {
        "city": "Philadelphia PA"
      },
      "studyType": "Bachelor of Science",
      "startDate": "2010-09-20",
      "endDate": "2015-06-15",
      "gpa": "4.0",
      "courses": [],
      "highlights": [
        "Major in Computer Engineering",
        "Minor in Electrical Engineering",
        "Minor in Business Administration"
      ]
    }
  ],
  "project": [],
  "work": [
    {
      "company": "Amazon Inc",
      "position": "Software Development Engineer II",
      "startDate": "2019-01",
      "endDate": "Present",
      "summary": "Focused on Amazon Device Reverse Logistics to re-architecture existing hard coded warehouse systems to a configurable AWS server-less architecture",
      "highlights": [
        "Redesigned, and Rearchitected all core services into a configurable orchestration service to replace hard-coded workflow system",
        null,
        "Designed and managed a multi-team initiative, reducing the number of service teams involved in reverse logistics by a third",
        null,
        "Pushed Team\\textquotesingle s Operational Excellence forward with new upgraded technology stack proposals",
        null,
        "Re-imagined teams agile process to include procedures and mechanisms to guarantee success; reduced sprint rollover by 75\\pct",
        null,
        "Introduced new tenants and goals for testing procedures to ensure tests were targeting and finding critical bugs within the existing architecture",
        null,
        "Hosted bi-monthly organization wide learning series to educate on various emerging technologies and development topics",
        null,
        "Mentored both projects and employees through initial stages of service design",
        null,
        "Collaborated with managers and leaders within department to establish goals, mechanisms, and techniques for increased productivity",
        null,
        "Managed product launches in each of the available reverse logistic regions",
        "Participated in interviewing and hiring new candidates to the Amazon Software Development Team",
        "Created a Points Poker application in response to Work From Home mandates to allow inclusive collaboration among team members in planning activities"
      ]
    },
    {
      "company": "URBN Inc",
      "position": "Software Developer",
      "startDate": "2015-08",
      "endDate": "2019-01",
      "summary": "Worked across numerous business and technology spaces to deliver products for e-commerce team",
      "highlights": [
        "Designed and managed the implementation of promotional engine for pricing service",
        null,
        "Worked with a team of four developers to build and launch a new brand website; which handled 4 million monthly visitors after initial launch",
        null,
        "Worked with a team of developers to build a product management system to be used with multiple brands; collectively handling about 26 million monthly visitors",
        null,
        "Worked with multiple teams to oversee weekly deployment cycle and ensure compatibility between all existing and new micro-service operations",
        null,
        "Worked with QA team to integrate a new QA UI Test developer into development team and create a UI Test Suite",
        null,
        "Helped to migrate legacy data from third party system to in-house solution using data migration scripts written in Python",
        null
      ]
    },
    {
      "company": "Philadelphia Game Lab",
      "position": "Lead Service Software Developer",
      "startDate": "2014-01",
      "endDate": "2015-08",
      "summary": "Designed and implemented a scalable Backend-as-a-Service infrastructure while managing developers across numerous teams",
      "highlights": [
        "Managed a team of eight programmers and a graphic artist through multiple primary projects",
        null,
        "Worked as team lead for Backend as a Service project designed to support applications created at small companies",
        null,
        "Managed personnel and project resource allocation for server-side technology department",
        null
      ]
    },
    {
      "company": "MyOhMy Design and Build",
      "position": "Co-Founder / Head of Software Development",
      "startDate": "2014-01",
      "endDate": "2015-08",
      "summary": "Co-founded a small company to fill a perceived market gap in apartment rental visualization, using priority tooling and technologies to expand efficiently while maintaining a small staff",
      "highlights": [
        "Acquired 50+ nation wide clients specializing in off-campus student housing in 15 states",
        null,
        "Innovated 3D modeling process, using CAD software, resulting in a sustained national commercial endeavor",
        null,
        "Expanded process to meet market needs and developed a staff to meet demand as business expanded",
        null,
        "Migrated a ASP.NET MVC website from Rackspace hosting server to an AWS EC2 instance for non-profit organization"
      ]
    },
    {
      "company": "SAP America",
      "position": "Global Customer Operations Co-Op",
      "startDate": "2013-04",
      "endDate": "2013-09",
      "summary": "",
      "highlights": [
        "Worked with a design team to build a cross platform mobile theme in CSS and JS which was deployed to internal teams (SAPUI5)",
        "Coordinated with numerous departments to gather requirements and develop internal department pages (SAP Portal)",
        "Built and updated department specific pages on the SAP internal social network (SAP JAM) after gathering requirements from VP level",
        "Trained business users in the use of HTML for the basic purpose of intranet editing in order to ensure continued maintenance of system content"
      ]
    },
    {
      "company": "National Board of Medical Examiners",
      "position": "Internet Services Co-Op",
      "startDate": "2012-04",
      "endDate": "2012-09",
      "summary": "",
      "highlights": [
        "Maintained multiple external and internal applications",
        "Integrated updated intranet with existing version in order to ensure compatibility with Microsoft SharePoint",
        "Designed and organized layout of new and existing web pages built on ASP.NET VB and Microsoft SharePoint",
        "Worked to modernize CSS and JS on existing applications"
      ]
    },
    {
      "company": "Campus Apartments",
      "position": "Web Technologies Associate",
      "startDate": "2010-09",
      "endDate": "2012-04",
      "summary": "",
      "highlights": [
        "Converted database centric proprietary Rental Management System and Tenant portal from ASP.net 1.1 to 4.0 utilizing code behind and Master Pages in VB and C++",
        "Simultaneously updated database from SQL Server 2000 to SQL Server 2008 and standardized table and stored procedure naming conventions",
        "Photographed buildings and edited images in Photoshop in order to further renters\\textquotesingle interest",
        "Helped introduce semi-agile work-flow with focus on pair-programming using VisualSVN for Visual Studio"
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "Saint Luke Lutheran Church",
      "position": "Volunteer Sound Engineer",
      "website": "http://saintlukedevon.org",
      "startDate": "2008-05-01",
      "endDate": "2013-09-01",
      "summary": "Worked to re-design and ....",
      "highlights": [
        "Managed Audio and Visual technology for the church services, and band performances",
        "Installed, upgraded, and maintained audio production equipment for three venues",
        "Worked with church committee to ensure funding and budget for audio engineering team",
        "Mentored and trained replacements on how to operate soundboard and audio technology",
        "Oversaw installation of two projectors and projector screens for visualization of services",
        "Organized and ensure smooth operations during events and services including personnel management"
      ]
    },
    {
      "organization": "National Organization for Business and Engineering",
      "position": "National Technology Chair",
      "website": "https://www.nobenational.org/",
      "startDate": "2012-09-01",
      "endDate": "2013-09-01"
    },
    {
      "organization": "Drexel University Math Student Organization",
      "position": "Website Management Chair",
      "website": "http://www.pages.drexel.edu/~dsomso/",
      "startDate": "2012-09-01",
      "endDate": "2013-09-01"
    },
    {
      "organization": "National Organization for Business and Engineering at Drexel",
      "position": "Technology Development Chair",
      "website": "https://www.nobedrexel.org/",
      "startDate": "2011-09-01",
      "endDate": "2012-09-01"
    }
  ],
  "interests": [
    {
      "name": "Sailing",
      "summary": "Certified Sailor, and Sailing enthusiast"
    }
  ],
  "languages": [
    {
      "language": "English",
      "level": "native"
    }
  ]
}