{
  "basics": {
    "label": "Software Development Manager",
    "website": "alpha59.github.io",
    "phone": "1-484-354-9199",
    "email": "ailor.john.r@gmail.com",
    "location": {
      "city": "Philadelphia",
      "region": "Pennsylvania"
    },
    "name": "John R. Ailor",
    "fname": "John",
    "mname": "R",
    "lname": "Ailor",
    "cover": "Find enclosed my resume, which outlines my relevant experience for this position, and education. I am an experienced Software Engineer with a demonstrated history of working in e-commerce, operations, and cloud computing. I am skilled in Software Architecture, Technical Writing, Software Development, and hold a Bachelor\\textquotesingle s degree focused on Computer Engineering from Drexel University. I have gained over ten years of experience working with a full-stack of web technologies and general back-end computing platforms. Over the course of my career, I have gained a great deal of experience writing technical reports and documenting software architecture. I have led several teams through various projects, and seen multiple projects go from concept to production under my supervision. On numerous occasions I have mentored team members in their project goals. I am a well-rounded programmer with a focus on software applications that contribute to advancing productivity and business goals of the company or customer. Any team I am given the opportunity to work with will find a dedicated employee who looks for the ideal solution to every problem. \\par My current career goals are aligned with moving towards a people management role in a technical space. This will help to expand the breadth of skills, while using my existing management style and techniques to drive innovation. Throughout my career, I have focused on capability building, for both technical solutions, and technical employees. As a Senior engineer, I work closely with Software developers, stakeholders, and leadership to persistently push for innovative solutions with capabilities beyond the momentary needs. As a Software Development Manager, the opportunities to expand on my force multiplying effect, and drive innovation will continue to expand.  \\par As a current employee of Amazon, I know that the Amazon team, and company culture are what allow them to strive for innovation. The culture within the Amazon, inspires employees to strive for the best. Software Development Teams at Amazon are truly unsurpassed in the ability to work as a software innovation leader, while giving the environment of an innovative start-up. Within every position, there is room for growth and opportunity, from a career perspective, and from the perspective of innovation. Lessons learned within the truly fast-paced development groups inform my ongoing decisions. I look forward to continuing my journey at Amazon in an SDM role where I am able to innovate and drive innovation.",
    "summary": "Senior Software Development Engineer at Amazon, actively seeking opportunities to transition into a Software Manager role.\\par I am particularly interested in people management within a technical domain, with the goal of broadening my abilities as a force multiplier. I remain open to roles that blend development and management responsibilities, leveraging my technical expertise while enhancing my leadership capabilities.\\par With over a decade of experience, I am a dedicated Software Engineer known for delivering highly configurable, scalable, and robust applications. I have successfully managed the re-architecture of numerous mission-critical applications, encompassing both customer-facing and operational systems. My ambition is to collaborate with an active team in a managerial capacity, striving to develop optimal software solutions.",
    "picture": "",
    "profiles": [
      {
        "network": "GitHub",
        "username": "alpha59",
        "url": "https://github.com/alpha59"
      },
      {
        "network": "LinkedIn",
        "username": "John R. Ailor",
        "url": "https://www.linkedin.com/in/john-r-ailor/"
      }
    ]
  },
  "skills": [
    {
      "name": "Front-end Development",
      "level": "Expert",
      "keywords": [
        "JavaScript",
        "React",
        "TypeScript",
        "jQuery"
      ]
    },
    {
      "name": "Microservice Development",
      "level": "Expert",
      "keywords": [
        "Node.js",
        "Python",
        "Java",
        "Microservice",
        "Nanoservice"
      ]
    },
    {
      "name": "Software Architecture",
      "level": "Expert",
      "keywords": [
        "AWS",
        "Cloud",
        "Database",
        "Microservice",
        "Nanoservice",
        "RDS",
        "MongoDB",
        "DocumentDB",
        "NoSql"
      ]
    },
    {
      "name": "Languages",
      "level": "Expert",
      "keywords": [
        "C++",
        "Python",
        "php",
        "Java",
        "JavaScript",
        "Node.js",
        "Ruby",
        "C#",
        "ASP.NET MVC",
        "VB",
        "C",
        "Awk",
        "Lisp",
        "Octave",
        "VHDL",
        "SQL",
        "perl",
        "Swift"
      ]
    },
    {
      "name": "Software/Applications",
      "level": "Expert",
      "keywords": [
        "MS Visual Studio",
        "Git",
        "Netbeans",
        "AutoCAD",
        "Sketchup",
        "LabView",
        "MS Office Suite with VB Macros",
        "MATLAB",
        "Hadoop",
        "Spark",
        "Linux (Bash)",
        "Vim",
        "Eclipse",
        "Unity",
        "Unreal"
      ]
    },
    {
      "name": "Databases",
      "level": "Expert",
      "keywords": [
        "MongoDB",
        "DocumentDB",
        "DynamoDB",
        "RDS",
        "MySQL",
        "Neo4j",
        "PostgreSQL",
        "Microsoft SQL Server",
        "Elasticsearch"
      ]
    },
    {
      "name": "Markup/Style",
      "level": "Expert",
      "keywords": [
        "Multi-Markdown",
        "HTML5",
        "LaTeX",
        "CSS3",
        "Bootstrap",
        "Sass",
        "LESS"
      ]
    },
    {
      "name": "Integration Testing",
      "level": "Expert",
      "keywords": [
        "Selenium",
        "nightwatch.js",
        "webdriver.io"
      ]
    }
  ],
  "meta": {
    "version": "vAMZN-SDM-1",
    "lastModified": "2021-06-05",
    "name": "resume",
    "role": "software-development-manager",
    "focus": "management",
    "company": "Amazon",
    "notes": "This resume is focused on an Amazon SDM position, tailored towards Amazon terms",
    "theme": "elegant"
  },
  "education": [
    {
      "institution": "Drexel University",
      "area": "Computer Engineering",
      "location": {
        "city": "Philadelphia PA"
      },
      "studyType": "Bachelor of Science",
      "startDate": "2010-09-20",
      "endDate": "2015-06-15",
      "gpa": "4.0",
      "courses": [],
      "highlights": [
        "Major in Computer Engineering",
        "Minor in Electrical Engineering",
        "Minor in Business Administration"
      ]
    }
  ],
  "project": [],
  "work": [
    {
      "company": "Amazon Inc",
      "position": "Sr. Software Development Engineer",
      "startDate": "2019-01",
      "endDate": "Present",
      "summary": "Concentrated on Amazon Device Reverse Logistics, re-Rearchitected existing hard-coded warehouse systems to a configurable AWS server-less architecture",
      "highlights": [
        "Rearchitected core services of the team into a configurable orchestration service to replace the hard-coded workflow system",
        null,
        "Launched a new return center to accommodate the release of major new product initiatives and the expected increase in returns",
        "Maintained an engineering team of nine developers, guiding the integration of Third-Party Retailer Device Returns and condensing operational lines by 30\\pct",
        null,
        "Served as the leader in definition and development of multi-tier web services for 5+ years, reducing legacy servers by 85\\pct, migrating to a serverless stack",
        null,
        "Re-imagined team\\textquotesingle s agile process to include procedures and mechanisms to guarantee success; reduced sprint rollover by 65\\pct",
        null,
        "Introduced new tenants and goals for testing procedures to target critical bugs within the existing architecture, decreasing escaped defects by 50\\pct",
        null,
        "Hosted bi-monthly organization-wide learning series to educate on emerging technologies and development topics",
        null,
        "Mentored projects and employees through initial stages of service design, project planning, and plan of record",
        null,
        "Collaborated with managers and leaders within the department to establish goals, mechanisms, and techniques for increased productivity",
        null,
        "Managed the redesign and re-architecture of Operations Portals, improving customer satisfaction scores by 25\\pct and reducing load times by 60\\pct",
        "Managed product launches in each of the available reverse logistic regions",
        "Participated in interviewing and hiring new candidates to the Amazon Software Development Team",
        "Created a Code Review Commit Message Analyzer with 150K monthly invocations across the company",
        "Collaborated in expanding a Points Poker application in response to work from home mandates to allow inclusive collaboration"
      ]
    },
    {
      "company": "URBN Inc",
      "position": "Software Developer",
      "startDate": "2015-08",
      "endDate": "2019-01",
      "summary": "Conducted work across numerous business and technology spaces to deliver products and services for e-commerce and merchandising teams",
      "highlights": [
        "Designed and managed the implementation of a promotional engine for the pricing service, handling 26 million monthly visitors",
        null,
        "Directed a team in building and launching a new brand website, maintaining 4 million monthly visitors post-launch",
        null,
        "Worked with a team of developers, delivering a product management system used across multiple brands; handling over 1 million products annually",
        null,
        "Worked with multiple teams to oversee the weekly deployment cycle and ensure compatibility between all existing and new microservice operations",
        null,
        "Worked with the QA team to integrate a new QA UI Test developer into the development team and create a UI Test Suite for continuous deployment",
        null,
        "Migrated legacy data from third-party systems to in-house solutions using Python scripts, reducing data processing times by 40\\pct. Exhibited bias for action by efficiently managing data migrations",
        null,
        "Collaborated with cross-functional teams, including business users and operations teams, to ensure comprehensive project understanding and alignment",
        "Mentored six junior developers and interns, guiding them through project development and helping them to achieve their career goals, thereby enhancing team capabilities"
      ]
    },
    {
      "company": "Philadelphia Game Lab",
      "position": "Service Software Technology Lead",
      "startDate": "2014-01",
      "endDate": "2015-08",
      "summary": "Designed and implemented a scalable Backend-as-a-Service infrastructure while managing developers across numerous teams.",
      "highlights": [
        "Managed a team of eight programmers and a graphic artist through multiple primary projects, including Android, Web, and Real-Time Gaming applications",
        null,
        "Worked as team lead for Backend-as-a-Service project designed to support applications created at start-up companies",
        null,
        "Managed personnel and project resource allocation for the server-side technology department",
        null,
        "Directly managed nine employees, helping them to grow professionally and contribute effectively to project goals, thereby enhancing overall team performance"
      ]
    },
    {
      "company": "MyOhMy Design and Build",
      "position": "Co-Founder / Head of Software Development",
      "startDate": "2010-03",
      "endDate": "2014-01",
      "summary": "Co-founded a company to fill a market gap in apartment rental visualization, using proprietary tools and technology to expand efficiently to a three person staff",
      "highlights": [
        "Acquired 50+ clients nationwide, specializing in off-campus student housing across 15 states, generating \\$500,000 in annual revenue",
        null,
        "Innovated the 3D modeling process using CAD software for apartment rental visualization, resulting in a sustained national commercial endeavor",
        null,
        "Expanded processes to meet market needs and developed a staff to meet demand as business expanded",
        null,
        "Migrated an ASP.NET MVC website from Rackspace to AWS EC2 for a non-profit organization, reducing hosting costs by 40\\pct. Portrayed Bias for Action by efficiently managing the migration process"
      ]
    },
    {
      "company": "SAP America",
      "position": "Global Customer Operations Developer",
      "startDate": "2013-04",
      "endDate": "2013-09",
      "summary": "Designed and launched a cross-platform mobile theme and coordinated with departments for internal page development",
      "highlights": [
        "Trained business users in HTML for intranet editing, reducing content update times by 60\\pct",
        null,
        "Collaborated with multiple departments to gather requirements and develop internal pages, reducing development cycle times by 30\\pct, showcasing strong cross-functional collaboration",
        null
      ]
    },
    {
      "company": "National Board of Medical Examiners",
      "position": "Internet Services Developer",
      "startDate": "2012-04",
      "endDate": "2012-09",
      "summary": "Maintained external and internal applications, integrated an updated intranet, and modernized CSS and JS",
      "highlights": [
        "Maintained multiple external and internal applications with 50,000 unique external customers per year",
        "Integrated updated intranet with existing version to ensure compatibility with Microsoft SharePoint",
        "Designed and organized layout of new and existing web pages built on ASP.NET VB and Microsoft SharePoint",
        "Worked to modernize CSS and JS on existing applications to use CSS3 and HTML5 APIs"
      ]
    },
    {
      "company": "Campus Apartments",
      "position": "Web Technologies Associate",
      "startDate": "2010-09",
      "endDate": "2012-04",
      "summary": "Converted a proprietary Rental Management System from ASP.net 1.1 to 4.0, updated SQL Server, and introduced semi-agile workflows",
      "highlights": [
        "Converted database-centric proprietary Rental Management System and Tenant Portal from ASP.net 1.1 to 4.0 utilizing code behind in VB and C++",
        "Simultaneously updated database from SQL Server 2000 to SQL Server 2008 and standardized table and stored procedure naming conventions",
        "Photographed buildings and edited images in Photoshop to attract renters\\textquotesingle interest",
        "Helped introduce semi-agile work flow with a focus on pair-programming using VisualSVN for Visual Studio"
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "Saint Luke Lutheran Church",
      "position": "Volunteer Sound Engineer",
      "website": "http://saintlukedevon.org",
      "startDate": "2008-05-01",
      "endDate": "2013-09-01",
      "summary": "Worked to re-design and manage audio and visual technology for church services and events",
      "highlights": [
        "Managed audio and visual technology for the church services, events, and band performances",
        "Installed, upgraded, and maintained audio production equipment for three venues. Replaced all audio-equipment with upgraded system components",
        "Worked with the budgetary committee to ensure funding and budget for the audio engineering team. Proposed end-to-end system upgrades through written budgetary proposals",
        "Organized and ensure smooth operations during events, including personnel management, scheduling, and post-processing",
        "Managed audio and visual technology for services and events, reducing audio system maintenance expenses by 50\\pct. Demonstrated customer obsession by ensuring high-quality audio and visual experiences",
        "Installed, upgraded, and maintained audio production equipment, reducing equipment downtime by 70\\pct. Showcased Invent and Simplify by enhancing the technical setup"
      ]
    },
    {
      "organization": "National Organization for Business and Engineering",
      "position": "National Technology Chair",
      "website": "https://www.nobenational.org/",
      "startDate": "2012-09-01",
      "endDate": "2013-09-01",
      "summary": "Maintained website and managed on-boarding of four new university chapters to the organization",
      "highlights": [
        "Introduced four new university chapters, including launching custom branded websites and training university technology chairs",
        "Managed the development of new features, including a stock market simulation competition, using resources from 10 university chapters for development",
        "Hosted weekly review with regional technology chairs to drive innovative seminars, talks, and workshops for members"
      ]
    },
    {
      "organization": "Drexel University Math Student Organization",
      "position": "Website Management Chair",
      "website": "http://www.pages.drexel.edu/~dsomso/",
      "startDate": "2012-09-01",
      "endDate": "2013-09-01",
      "summary": "Implemented, launched, and maintained website to host calendar of events and organizational updates",
      "highlights": [
        "Organized with student committee and staff advisors to design and implement a website for organization",
        "Hosted weekly events with organization members to drive knowledge sharing within mathematics community"
      ]
    },
    {
      "organization": "National Organization for Business and Engineering at Drexel",
      "position": "Technology Development Chair",
      "website": "https://www.nobedrexel.org/",
      "startDate": "2011-09-01",
      "endDate": "2012-09-01",
      "summary": "Worked with university chapter and national chapter to organize events, maintain websites functionality, and host national conference",
      "highlights": [
        "Attended weekly sync with national chapter technology chair to present updates on website progress and upcoming events",
        "Organized monthly engineering focused events to create a cross-collaborative space between business and engineering students",
        "Created technology focused sections of National Conference bid; Recruited presenters for national conference after being selected to host"
      ]
    }
  ],
  "interests": [
    {
      "name": "Sailing",
      "summary": "Certified Sailor, and Sailing Enthusiast"
    },
    {
      "name": "Motorcycles",
      "summary": "Licensed Motorcyclist, and Motorcycle Enthusiast"
    }
  ],
  "languages": [
    {
      "language": "English",
      "level": "Native"
    }
  ]
}